Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_DCON0_Bits.DCBYP */
#define IFX_CPU_DCON0_DCBYP_OFF (1)

/** \brief  Length for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_LEN (16)

/** \brief  Mask for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_MSK (0xffff)

/** \brief  Offset for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_OFF (0)

/** \brief  Length for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_LEN (16)

/** \brief  Mask for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_MSK (0xffff)

/** \brief  Offset for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_OFF (16)

/** \brief  Length for Ifx_CPU_DCX_Bits.DCXValue */
#define IFX_CPU_DCX_DCXVALUE_LEN (26)

/** \brief  Mask for Ifx_CPU_DCX_Bits.DCXValue */
#define IFX_CPU_DCX_DCXVALUE_MSK (0x3ffffff)

/** \brief  Offset for Ifx_CPU_DCX_Bits.DCXValue */
#define IFX_CPU_DCX_DCXVALUE_OFF (6)

/** \brief  Length for Ifx_CPU_DEADD_Bits.ERROR_ADDRESS */
#define IFX_CPU_DEADD_ERROR_ADDRESS_LEN (32)

/** \brief  Mask for Ifx_CPU_DEADD_Bits.ERROR_ADDRESS */
#define IFX_CPU_DEADD_ERROR_ADDRESS_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DEADD_Bits.ERROR_ADDRESS */
#define IFX_CPU_DEADD_ERROR_ADDRESS_OFF (0)

/** \brief  Length for Ifx_CPU_DIEAR_Bits.TA */
#define IFX_CPU_DIEAR_TA_LEN (32)

/** \brief  Mask for Ifx_CPU_DIEAR_Bits.TA */
#define IFX_CPU_DIEAR_TA_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DIEAR_Bits.TA */
#define IFX_CPU_DIEAR_TA_OFF (0)

/** \brief  Length for Ifx_CPU_DIETR_Bits.E_INFO */
#define IFX_CPU_DIETR_E_INFO_LEN (6)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.E_INFO */
#define IFX_CPU_DIETR_E_INFO_MSK (0x3f)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.E_INFO */
#define IFX_CPU_DIETR_E_INFO_OFF (5)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_BI */
#define IFX_CPU_DIETR_IE_BI_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_BI */
#define IFX_CPU_DIETR_IE_BI_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_BI */
#define IFX_CPU_DIETR_IE_BI_OFF (4)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_BS */
#define IFX_CPU_DIETR_IE_BS_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_BS */
#define IFX_CPU_DIETR_IE_BS_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_BS */
#define IFX_CPU_DIETR_IE_BS_OFF (13)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_C */
#define IFX_CPU_DIETR_IE_C_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_C */
#define IFX_CPU_DIETR_IE_C_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_C */
#define IFX_CPU_DIETR_IE_C_OFF (2)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_DLMU */
#define IFX_CPU_DIETR_IE_DLMU_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_DLMU */
#define IFX_CPU_DIETR_IE_DLMU_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_DLMU */
#define IFX_CPU_DIETR_IE_DLMU_OFF (14)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_LPB */
#define IFX_CPU_DIETR_IE_LPB_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_LPB */
#define IFX_CPU_DIETR_IE_LPB_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_LPB */
#define IFX_CPU_DIETR_IE_LPB_OFF (15)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_S */
#define IFX_CPU_DIETR_IE_S_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_S */
#define IFX_CPU_DIETR_IE_S_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_S */
#define IFX_CPU_DIETR_IE_S_OFF (3)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_SP */
#define IFX_CPU_DIETR_IE_SP_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_SP */
#define IFX_CPU_DIETR_IE_SP_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_SP */
#define IFX_CPU_DIETR_IE_SP_OFF (12)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_T */
#define IFX_CPU_DIETR_IE_T_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_T */
#define IFX_CPU_DIETR_IE_T_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_T */
#define IFX_CPU_DIETR_IE_T_OFF (1)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IE_UNC */
#define IFX_CPU_DIETR_IE_UNC_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IE_UNC */
#define IFX_CPU_DIETR_IE_UNC_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IE_UNC */
#define IFX_CPU_DIETR_IE_UNC_OFF (11)

/** \brief  Length for Ifx_CPU_DIETR_Bits.IED */
#define IFX_CPU_DIETR_IED_LEN (1)

/** \brief  Mask for Ifx_CPU_DIETR_Bits.IED */
#define IFX_CPU_DIETR_IED_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DIETR_Bits.IED */
#define IFX_CPU_DIETR_IED_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGN_ACCENA_W_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGN_ACCENA_W_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGN_ACCENA_W_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_LA_ADDR_LEN (27)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_LA_ADDR_MSK (0x7ffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_LA_ADDR_OFF (5)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_UA_ADDR_LEN (27)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_UA_ADDR_MSK (0x7ffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGN_UA_ADDR_OFF (5)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA0_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA0_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA0_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA1_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA1_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA1_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA2_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA2_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA2_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA3_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA3_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA3_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA4_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA4_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA4_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA5_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA5_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA5_R_EN_OFF (0)

