Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA6_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA6_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA6_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA7_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA7_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA7_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_DMS_Bits.DMSValue */
#define IFX_CPU_DMS_DMSVALUE_LEN (31)

/** \brief  Mask for Ifx_CPU_DMS_Bits.DMSValue */
#define IFX_CPU_DMS_DMSVALUE_MSK (0x7fffffff)

/** \brief  Offset for Ifx_CPU_DMS_Bits.DMSValue */
#define IFX_CPU_DMS_DMSVALUE_OFF (1)

/** \brief  Length for Ifx_CPU_DPR_L_Bits.LOWBND */
#define IFX_CPU_DPR_L_LOWBND_LEN (29)

/** \brief  Mask for Ifx_CPU_DPR_L_Bits.LOWBND */
#define IFX_CPU_DPR_L_LOWBND_MSK (0x1fffffff)

/** \brief  Offset for Ifx_CPU_DPR_L_Bits.LOWBND */
#define IFX_CPU_DPR_L_LOWBND_OFF (3)

/** \brief  Length for Ifx_CPU_DPR_U_Bits.UPPBND */
#define IFX_CPU_DPR_U_UPPBND_LEN (29)

/** \brief  Mask for Ifx_CPU_DPR_U_Bits.UPPBND */
#define IFX_CPU_DPR_U_UPPBND_MSK (0x1fffffff)

/** \brief  Offset for Ifx_CPU_DPR_U_Bits.UPPBND */
#define IFX_CPU_DPR_U_UPPBND_OFF (3)

/** \brief  Length for Ifx_CPU_DPRE_0_Bits.RE */
#define IFX_CPU_DPRE_0_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_0_Bits.RE */
#define IFX_CPU_DPRE_0_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_0_Bits.RE */
#define IFX_CPU_DPRE_0_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPRE_1_Bits.RE */
#define IFX_CPU_DPRE_1_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_1_Bits.RE */
#define IFX_CPU_DPRE_1_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_1_Bits.RE */
#define IFX_CPU_DPRE_1_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPRE_2_Bits.RE */
#define IFX_CPU_DPRE_2_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_2_Bits.RE */
#define IFX_CPU_DPRE_2_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_2_Bits.RE */
#define IFX_CPU_DPRE_2_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPRE_3_Bits.RE */
#define IFX_CPU_DPRE_3_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_3_Bits.RE */
#define IFX_CPU_DPRE_3_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_3_Bits.RE */
#define IFX_CPU_DPRE_3_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPRE_4_Bits.RE */
#define IFX_CPU_DPRE_4_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_4_Bits.RE */
#define IFX_CPU_DPRE_4_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_4_Bits.RE */
#define IFX_CPU_DPRE_4_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPRE_5_Bits.RE */
#define IFX_CPU_DPRE_5_RE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPRE_5_Bits.RE */
#define IFX_CPU_DPRE_5_RE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPRE_5_Bits.RE */
#define IFX_CPU_DPRE_5_RE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_0_Bits.WE */
#define IFX_CPU_DPWE_0_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_0_Bits.WE */
#define IFX_CPU_DPWE_0_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_0_Bits.WE */
#define IFX_CPU_DPWE_0_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_1_Bits.WE */
#define IFX_CPU_DPWE_1_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_1_Bits.WE */
#define IFX_CPU_DPWE_1_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_1_Bits.WE */
#define IFX_CPU_DPWE_1_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_2_Bits.WE */
#define IFX_CPU_DPWE_2_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_2_Bits.WE */
#define IFX_CPU_DPWE_2_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_2_Bits.WE */
#define IFX_CPU_DPWE_2_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_3_Bits.WE */
#define IFX_CPU_DPWE_3_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_3_Bits.WE */
#define IFX_CPU_DPWE_3_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_3_Bits.WE */
#define IFX_CPU_DPWE_3_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_4_Bits.WE */
#define IFX_CPU_DPWE_4_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_4_Bits.WE */
#define IFX_CPU_DPWE_4_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_4_Bits.WE */
#define IFX_CPU_DPWE_4_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DPWE_5_Bits.WE */
#define IFX_CPU_DPWE_5_WE_LEN (18)

/** \brief  Mask for Ifx_CPU_DPWE_5_Bits.WE */
#define IFX_CPU_DPWE_5_WE_MSK (0x3ffff)

/** \brief  Offset for Ifx_CPU_DPWE_5_Bits.WE */
#define IFX_CPU_DPWE_5_WE_OFF (0)

/** \brief  Length for Ifx_CPU_DSTR_Bits.ALN */
#define IFX_CPU_DSTR_ALN_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.ALN */
#define IFX_CPU_DSTR_ALN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.ALN */
#define IFX_CPU_DSTR_ALN_OFF (24)

/** \brief  Length for Ifx_CPU_DSTR_Bits.CAC */
#define IFX_CPU_DSTR_CAC_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.CAC */
#define IFX_CPU_DSTR_CAC_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.CAC */
#define IFX_CPU_DSTR_CAC_OFF (18)

/** \brief  Length for Ifx_CPU_DSTR_Bits.CLE */
#define IFX_CPU_DSTR_CLE_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.CLE */
#define IFX_CPU_DSTR_CLE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.CLE */
#define IFX_CPU_DSTR_CLE_OFF (20)

/** \brief  Length for Ifx_CPU_DSTR_Bits.CRE */
#define IFX_CPU_DSTR_CRE_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.CRE */
#define IFX_CPU_DSTR_CRE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.CRE */
#define IFX_CPU_DSTR_CRE_OFF (6)

/** \brief  Length for Ifx_CPU_DSTR_Bits.DTME */
#define IFX_CPU_DSTR_DTME_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.DTME */
#define IFX_CPU_DSTR_DTME_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.DTME */
#define IFX_CPU_DSTR_DTME_OFF (14)

/** \brief  Length for Ifx_CPU_DSTR_Bits.GAE */
#define IFX_CPU_DSTR_GAE_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.GAE */
#define IFX_CPU_DSTR_GAE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.GAE */
#define IFX_CPU_DSTR_GAE_OFF (1)

/** \brief  Length for Ifx_CPU_DSTR_Bits.LBE */
#define IFX_CPU_DSTR_LBE_LEN (1)

/** \brief  Mask for Ifx_CPU_DSTR_Bits.LBE */
#define IFX_CPU_DSTR_LBE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_DSTR_Bits.LBE */
#define IFX_CPU_DSTR_LBE_OFF (2)

