Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_OFF (25)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_OFF (1)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_OFF (16)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_OFF (8)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_OFF (26)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_OFF (9)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_OFF (0)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_OFF (24)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.SPARE2 */
#define IFX_CPU_FLASHCON2_SPARE2_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.SPARE2 */
#define IFX_CPU_FLASHCON2_SPARE2_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.SPARE2 */
#define IFX_CPU_FLASHCON2_SPARE2_OFF (2)

/** \brief  Length for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_OFF (27)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_OFF (3)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_OFF (0)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_OFF (1)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_OFF (4)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_OFF (2)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.SPARELBYTE */
#define IFX_CPU_FLASHCON3_SPARELBYTE_LEN (8)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.SPARELBYTE */
#define IFX_CPU_FLASHCON3_SPARELBYTE_MSK (0xff)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.SPARELBYTE */
#define IFX_CPU_FLASHCON3_SPARELBYTE_OFF (16)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.SPAREUBYTE */
#define IFX_CPU_FLASHCON3_SPAREUBYTE_LEN (8)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.SPAREUBYTE */
#define IFX_CPU_FLASHCON3_SPAREUBYTE_MSK (0xff)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.SPAREUBYTE */
#define IFX_CPU_FLASHCON3_SPAREUBYTE_OFF (24)

/** \brief  Length for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_LEN (1)

/** \brief  Mask for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_OFF (5)

/** \brief  Length for Ifx_CPU_FPU_TRAP_CON_Bits.FI */
#define IFX_CPU_FPU_TRAP_CON_FI_LEN (1)

/** \brief  Mask for Ifx_CPU_FPU_TRAP_CON_Bits.FI */
#define IFX_CPU_FPU_TRAP_CON_FI_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FPU_TRAP_CON_Bits.FI */
#define IFX_CPU_FPU_TRAP_CON_FI_OFF (30)

/** \brief  Length for Ifx_CPU_FPU_TRAP_CON_Bits.FIE */
#define IFX_CPU_FPU_TRAP_CON_FIE_LEN (1)

/** \brief  Mask for Ifx_CPU_FPU_TRAP_CON_Bits.FIE */
#define IFX_CPU_FPU_TRAP_CON_FIE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FPU_TRAP_CON_Bits.FIE */
#define IFX_CPU_FPU_TRAP_CON_FIE_OFF (22)

/** \brief  Length for Ifx_CPU_FPU_TRAP_CON_Bits.FU */
#define IFX_CPU_FPU_TRAP_CON_FU_LEN (1)

/** \brief  Mask for Ifx_CPU_FPU_TRAP_CON_Bits.FU */
#define IFX_CPU_FPU_TRAP_CON_FU_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FPU_TRAP_CON_Bits.FU */
#define IFX_CPU_FPU_TRAP_CON_FU_OFF (27)

/** \brief  Length for Ifx_CPU_FPU_TRAP_CON_Bits.FUE */
#define IFX_CPU_FPU_TRAP_CON_FUE_LEN (1)

/** \brief  Mask for Ifx_CPU_FPU_TRAP_CON_Bits.FUE */
#define IFX_CPU_FPU_TRAP_CON_FUE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_FPU_TRAP_CON_Bits.FUE */
#define IFX_CPU_FPU_TRAP_CON_FUE_OFF (19)

/** \brief  Length for Ifx_CPU_FPU_TRAP_CON_Bits.FV */
#define IFX_CPU_FPU_TRAP_CON_FV_LEN (1)

