Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_ISP_Bits.ISP */
#define IFX_CPU_ISP_ISP_OFF (0)

/** \brief  Length for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_LEN (1)

/** \brief  Mask for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_MSK (0x1)

/** \brief  Offset for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_OFF (0)

/** \brief  Length for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_LEN (2)

/** \brief  Mask for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_MSK (0x3)

/** \brief  Offset for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_OFF (1)

/** \brief  Length for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_LEN (1)

/** \brief  Mask for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_MSK (0x1)

/** \brief  Offset for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_OFF (0)

/** \brief  Length for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_LEN (1)

/** \brief  Mask for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_MSK (0x1)

/** \brief  Offset for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_OFF (0)

/** \brief  Length for Ifx_CPU_LCX_Bits.LCXO */
#define IFX_CPU_LCX_LCXO_LEN (16)

/** \brief  Mask for Ifx_CPU_LCX_Bits.LCXO */
#define IFX_CPU_LCX_LCXO_MSK (0xffff)

/** \brief  Offset for Ifx_CPU_LCX_Bits.LCXO */
#define IFX_CPU_LCX_LCXO_OFF (0)

/** \brief  Length for Ifx_CPU_LCX_Bits.LCXS */
#define IFX_CPU_LCX_LCXS_LEN (4)

/** \brief  Mask for Ifx_CPU_LCX_Bits.LCXS */
#define IFX_CPU_LCX_LCXS_MSK (0xf)

/** \brief  Offset for Ifx_CPU_LCX_Bits.LCXS */
#define IFX_CPU_LCX_LCXS_OFF (16)

/** \brief  Length for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_M1CNT_Bits.CountValue */
#define IFX_CPU_M1CNT_COUNTVALUE_LEN (31)

/** \brief  Mask for Ifx_CPU_M1CNT_Bits.CountValue */
#define IFX_CPU_M1CNT_COUNTVALUE_MSK (0x7fffffff)

/** \brief  Offset for Ifx_CPU_M1CNT_Bits.CountValue */
#define IFX_CPU_M1CNT_COUNTVALUE_OFF (0)

/** \brief  Length for Ifx_CPU_M1CNT_Bits.SOvf */
#define IFX_CPU_M1CNT_SOVF_LEN (1)

/** \brief  Mask for Ifx_CPU_M1CNT_Bits.SOvf */
#define IFX_CPU_M1CNT_SOVF_MSK (0x1)

/** \brief  Offset for Ifx_CPU_M1CNT_Bits.SOvf */
#define IFX_CPU_M1CNT_SOVF_OFF (31)

/** \brief  Length for Ifx_CPU_M2CNT_Bits.CountValue */
#define IFX_CPU_M2CNT_COUNTVALUE_LEN (31)

/** \brief  Mask for Ifx_CPU_M2CNT_Bits.CountValue */
#define IFX_CPU_M2CNT_COUNTVALUE_MSK (0x7fffffff)

/** \brief  Offset for Ifx_CPU_M2CNT_Bits.CountValue */
#define IFX_CPU_M2CNT_COUNTVALUE_OFF (0)

/** \brief  Length for Ifx_CPU_M2CNT_Bits.SOvf */
#define IFX_CPU_M2CNT_SOVF_LEN (1)

/** \brief  Mask for Ifx_CPU_M2CNT_Bits.SOvf */
#define IFX_CPU_M2CNT_SOVF_MSK (0x1)

/** \brief  Offset for Ifx_CPU_M2CNT_Bits.SOvf */
#define IFX_CPU_M2CNT_SOVF_OFF (31)

/** \brief  Length for Ifx_CPU_M3CNT_Bits.CountValue */
#define IFX_CPU_M3CNT_COUNTVALUE_LEN (31)

/** \brief  Mask for Ifx_CPU_M3CNT_Bits.CountValue */
#define IFX_CPU_M3CNT_COUNTVALUE_MSK (0x7fffffff)

/** \brief  Offset for Ifx_CPU_M3CNT_Bits.CountValue */
#define IFX_CPU_M3CNT_COUNTVALUE_OFF (0)

/** \brief  Length for Ifx_CPU_M3CNT_Bits.SOvf */
#define IFX_CPU_M3CNT_SOVF_LEN (1)

/** \brief  Mask for Ifx_CPU_M3CNT_Bits.SOvf */
#define IFX_CPU_M3CNT_SOVF_MSK (0x1)

/** \brief  Offset for Ifx_CPU_M3CNT_Bits.SOvf */
#define IFX_CPU_M3CNT_SOVF_OFF (31)

/** \brief  Length for Ifx_CPU_OMASK0_Bits.OMASK */
#define IFX_CPU_OMASK0_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK0_Bits.OMASK */
#define IFX_CPU_OMASK0_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK0_Bits.OMASK */
#define IFX_CPU_OMASK0_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK0_Bits.ONE */
#define IFX_CPU_OMASK0_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK0_Bits.ONE */
#define IFX_CPU_OMASK0_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK0_Bits.ONE */
#define IFX_CPU_OMASK0_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK10_Bits.OMASK */
#define IFX_CPU_OMASK10_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK10_Bits.OMASK */
#define IFX_CPU_OMASK10_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK10_Bits.OMASK */
#define IFX_CPU_OMASK10_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK10_Bits.ONE */
#define IFX_CPU_OMASK10_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK10_Bits.ONE */
#define IFX_CPU_OMASK10_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK10_Bits.ONE */
#define IFX_CPU_OMASK10_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK11_Bits.OMASK */
#define IFX_CPU_OMASK11_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK11_Bits.OMASK */
#define IFX_CPU_OMASK11_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK11_Bits.OMASK */
#define IFX_CPU_OMASK11_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK11_Bits.ONE */
#define IFX_CPU_OMASK11_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK11_Bits.ONE */
#define IFX_CPU_OMASK11_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK11_Bits.ONE */
#define IFX_CPU_OMASK11_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK12_Bits.OMASK */
#define IFX_CPU_OMASK12_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK12_Bits.OMASK */
#define IFX_CPU_OMASK12_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK12_Bits.OMASK */
#define IFX_CPU_OMASK12_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK12_Bits.ONE */
#define IFX_CPU_OMASK12_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK12_Bits.ONE */
#define IFX_CPU_OMASK12_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK12_Bits.ONE */
#define IFX_CPU_OMASK12_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK13_Bits.OMASK */
#define IFX_CPU_OMASK13_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK13_Bits.OMASK */
#define IFX_CPU_OMASK13_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK13_Bits.OMASK */
#define IFX_CPU_OMASK13_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK13_Bits.ONE */
#define IFX_CPU_OMASK13_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK13_Bits.ONE */
#define IFX_CPU_OMASK13_ONE_MSK (0x7ff)

