Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_OMASK13_Bits.ONE */
#define IFX_CPU_OMASK13_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK14_Bits.OMASK */
#define IFX_CPU_OMASK14_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK14_Bits.OMASK */
#define IFX_CPU_OMASK14_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK14_Bits.OMASK */
#define IFX_CPU_OMASK14_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK14_Bits.ONE */
#define IFX_CPU_OMASK14_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK14_Bits.ONE */
#define IFX_CPU_OMASK14_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK14_Bits.ONE */
#define IFX_CPU_OMASK14_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK15_Bits.OMASK */
#define IFX_CPU_OMASK15_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK15_Bits.OMASK */
#define IFX_CPU_OMASK15_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK15_Bits.OMASK */
#define IFX_CPU_OMASK15_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK15_Bits.ONE */
#define IFX_CPU_OMASK15_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK15_Bits.ONE */
#define IFX_CPU_OMASK15_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK15_Bits.ONE */
#define IFX_CPU_OMASK15_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK16_Bits.OMASK */
#define IFX_CPU_OMASK16_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK16_Bits.OMASK */
#define IFX_CPU_OMASK16_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK16_Bits.OMASK */
#define IFX_CPU_OMASK16_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK16_Bits.ONE */
#define IFX_CPU_OMASK16_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK16_Bits.ONE */
#define IFX_CPU_OMASK16_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK16_Bits.ONE */
#define IFX_CPU_OMASK16_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK17_Bits.OMASK */
#define IFX_CPU_OMASK17_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK17_Bits.OMASK */
#define IFX_CPU_OMASK17_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK17_Bits.OMASK */
#define IFX_CPU_OMASK17_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK17_Bits.ONE */
#define IFX_CPU_OMASK17_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK17_Bits.ONE */
#define IFX_CPU_OMASK17_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK17_Bits.ONE */
#define IFX_CPU_OMASK17_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK18_Bits.OMASK */
#define IFX_CPU_OMASK18_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK18_Bits.OMASK */
#define IFX_CPU_OMASK18_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK18_Bits.OMASK */
#define IFX_CPU_OMASK18_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK18_Bits.ONE */
#define IFX_CPU_OMASK18_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK18_Bits.ONE */
#define IFX_CPU_OMASK18_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK18_Bits.ONE */
#define IFX_CPU_OMASK18_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK19_Bits.OMASK */
#define IFX_CPU_OMASK19_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK19_Bits.OMASK */
#define IFX_CPU_OMASK19_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK19_Bits.OMASK */
#define IFX_CPU_OMASK19_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK19_Bits.ONE */
#define IFX_CPU_OMASK19_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK19_Bits.ONE */
#define IFX_CPU_OMASK19_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK19_Bits.ONE */
#define IFX_CPU_OMASK19_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK1_Bits.OMASK */
#define IFX_CPU_OMASK1_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK1_Bits.OMASK */
#define IFX_CPU_OMASK1_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK1_Bits.OMASK */
#define IFX_CPU_OMASK1_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK1_Bits.ONE */
#define IFX_CPU_OMASK1_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK1_Bits.ONE */
#define IFX_CPU_OMASK1_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK1_Bits.ONE */
#define IFX_CPU_OMASK1_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK20_Bits.OMASK */
#define IFX_CPU_OMASK20_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK20_Bits.OMASK */
#define IFX_CPU_OMASK20_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK20_Bits.OMASK */
#define IFX_CPU_OMASK20_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK20_Bits.ONE */
#define IFX_CPU_OMASK20_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK20_Bits.ONE */
#define IFX_CPU_OMASK20_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK20_Bits.ONE */
#define IFX_CPU_OMASK20_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK21_Bits.OMASK */
#define IFX_CPU_OMASK21_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK21_Bits.OMASK */
#define IFX_CPU_OMASK21_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK21_Bits.OMASK */
#define IFX_CPU_OMASK21_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK21_Bits.ONE */
#define IFX_CPU_OMASK21_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK21_Bits.ONE */
#define IFX_CPU_OMASK21_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK21_Bits.ONE */
#define IFX_CPU_OMASK21_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK22_Bits.OMASK */
#define IFX_CPU_OMASK22_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK22_Bits.OMASK */
#define IFX_CPU_OMASK22_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK22_Bits.OMASK */
#define IFX_CPU_OMASK22_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK22_Bits.ONE */
#define IFX_CPU_OMASK22_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK22_Bits.ONE */
#define IFX_CPU_OMASK22_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK22_Bits.ONE */
#define IFX_CPU_OMASK22_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK23_Bits.OMASK */
#define IFX_CPU_OMASK23_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK23_Bits.OMASK */
#define IFX_CPU_OMASK23_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK23_Bits.OMASK */
#define IFX_CPU_OMASK23_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK23_Bits.ONE */
#define IFX_CPU_OMASK23_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK23_Bits.ONE */
#define IFX_CPU_OMASK23_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK23_Bits.ONE */
#define IFX_CPU_OMASK23_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK24_Bits.OMASK */
#define IFX_CPU_OMASK24_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK24_Bits.OMASK */
#define IFX_CPU_OMASK24_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK24_Bits.OMASK */
#define IFX_CPU_OMASK24_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK24_Bits.ONE */
#define IFX_CPU_OMASK24_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK24_Bits.ONE */
#define IFX_CPU_OMASK24_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK24_Bits.ONE */
#define IFX_CPU_OMASK24_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK25_Bits.OMASK */
#define IFX_CPU_OMASK25_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK25_Bits.OMASK */
#define IFX_CPU_OMASK25_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK25_Bits.OMASK */
#define IFX_CPU_OMASK25_OMASK_OFF (5)

