Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Length for Ifx_CPU_OMASK25_Bits.ONE */
#define IFX_CPU_OMASK25_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK25_Bits.ONE */
#define IFX_CPU_OMASK25_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK25_Bits.ONE */
#define IFX_CPU_OMASK25_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK26_Bits.OMASK */
#define IFX_CPU_OMASK26_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK26_Bits.OMASK */
#define IFX_CPU_OMASK26_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK26_Bits.OMASK */
#define IFX_CPU_OMASK26_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK26_Bits.ONE */
#define IFX_CPU_OMASK26_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK26_Bits.ONE */
#define IFX_CPU_OMASK26_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK26_Bits.ONE */
#define IFX_CPU_OMASK26_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK27_Bits.OMASK */
#define IFX_CPU_OMASK27_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK27_Bits.OMASK */
#define IFX_CPU_OMASK27_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK27_Bits.OMASK */
#define IFX_CPU_OMASK27_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK27_Bits.ONE */
#define IFX_CPU_OMASK27_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK27_Bits.ONE */
#define IFX_CPU_OMASK27_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK27_Bits.ONE */
#define IFX_CPU_OMASK27_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK28_Bits.OMASK */
#define IFX_CPU_OMASK28_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK28_Bits.OMASK */
#define IFX_CPU_OMASK28_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK28_Bits.OMASK */
#define IFX_CPU_OMASK28_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK28_Bits.ONE */
#define IFX_CPU_OMASK28_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK28_Bits.ONE */
#define IFX_CPU_OMASK28_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK28_Bits.ONE */
#define IFX_CPU_OMASK28_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK29_Bits.OMASK */
#define IFX_CPU_OMASK29_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK29_Bits.OMASK */
#define IFX_CPU_OMASK29_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK29_Bits.OMASK */
#define IFX_CPU_OMASK29_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK29_Bits.ONE */
#define IFX_CPU_OMASK29_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK29_Bits.ONE */
#define IFX_CPU_OMASK29_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK29_Bits.ONE */
#define IFX_CPU_OMASK29_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK2_Bits.OMASK */
#define IFX_CPU_OMASK2_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK2_Bits.OMASK */
#define IFX_CPU_OMASK2_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK2_Bits.OMASK */
#define IFX_CPU_OMASK2_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK2_Bits.ONE */
#define IFX_CPU_OMASK2_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK2_Bits.ONE */
#define IFX_CPU_OMASK2_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK2_Bits.ONE */
#define IFX_CPU_OMASK2_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK30_Bits.OMASK */
#define IFX_CPU_OMASK30_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK30_Bits.OMASK */
#define IFX_CPU_OMASK30_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK30_Bits.OMASK */
#define IFX_CPU_OMASK30_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK30_Bits.ONE */
#define IFX_CPU_OMASK30_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK30_Bits.ONE */
#define IFX_CPU_OMASK30_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK30_Bits.ONE */
#define IFX_CPU_OMASK30_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK31_Bits.OMASK */
#define IFX_CPU_OMASK31_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK31_Bits.OMASK */
#define IFX_CPU_OMASK31_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK31_Bits.OMASK */
#define IFX_CPU_OMASK31_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK31_Bits.ONE */
#define IFX_CPU_OMASK31_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK31_Bits.ONE */
#define IFX_CPU_OMASK31_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK31_Bits.ONE */
#define IFX_CPU_OMASK31_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK3_Bits.OMASK */
#define IFX_CPU_OMASK3_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK3_Bits.OMASK */
#define IFX_CPU_OMASK3_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK3_Bits.OMASK */
#define IFX_CPU_OMASK3_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK3_Bits.ONE */
#define IFX_CPU_OMASK3_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK3_Bits.ONE */
#define IFX_CPU_OMASK3_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK3_Bits.ONE */
#define IFX_CPU_OMASK3_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK4_Bits.OMASK */
#define IFX_CPU_OMASK4_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK4_Bits.OMASK */
#define IFX_CPU_OMASK4_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK4_Bits.OMASK */
#define IFX_CPU_OMASK4_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK4_Bits.ONE */
#define IFX_CPU_OMASK4_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK4_Bits.ONE */
#define IFX_CPU_OMASK4_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK4_Bits.ONE */
#define IFX_CPU_OMASK4_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK5_Bits.OMASK */
#define IFX_CPU_OMASK5_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK5_Bits.OMASK */
#define IFX_CPU_OMASK5_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK5_Bits.OMASK */
#define IFX_CPU_OMASK5_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK5_Bits.ONE */
#define IFX_CPU_OMASK5_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK5_Bits.ONE */
#define IFX_CPU_OMASK5_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK5_Bits.ONE */
#define IFX_CPU_OMASK5_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK6_Bits.OMASK */
#define IFX_CPU_OMASK6_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK6_Bits.OMASK */
#define IFX_CPU_OMASK6_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK6_Bits.OMASK */
#define IFX_CPU_OMASK6_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK6_Bits.ONE */
#define IFX_CPU_OMASK6_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK6_Bits.ONE */
#define IFX_CPU_OMASK6_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK6_Bits.ONE */
#define IFX_CPU_OMASK6_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK7_Bits.OMASK */
#define IFX_CPU_OMASK7_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK7_Bits.OMASK */
#define IFX_CPU_OMASK7_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK7_Bits.OMASK */
#define IFX_CPU_OMASK7_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK7_Bits.ONE */
#define IFX_CPU_OMASK7_ONE_LEN (11)

