Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Mask for Ifx_CPU_OMASK7_Bits.ONE */
#define IFX_CPU_OMASK7_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK7_Bits.ONE */
#define IFX_CPU_OMASK7_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK8_Bits.OMASK */
#define IFX_CPU_OMASK8_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK8_Bits.OMASK */
#define IFX_CPU_OMASK8_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK8_Bits.OMASK */
#define IFX_CPU_OMASK8_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK8_Bits.ONE */
#define IFX_CPU_OMASK8_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK8_Bits.ONE */
#define IFX_CPU_OMASK8_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK8_Bits.ONE */
#define IFX_CPU_OMASK8_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OMASK9_Bits.OMASK */
#define IFX_CPU_OMASK9_OMASK_LEN (12)

/** \brief  Mask for Ifx_CPU_OMASK9_Bits.OMASK */
#define IFX_CPU_OMASK9_OMASK_MSK (0xfff)

/** \brief  Offset for Ifx_CPU_OMASK9_Bits.OMASK */
#define IFX_CPU_OMASK9_OMASK_OFF (5)

/** \brief  Length for Ifx_CPU_OMASK9_Bits.ONE */
#define IFX_CPU_OMASK9_ONE_LEN (11)

/** \brief  Mask for Ifx_CPU_OMASK9_Bits.ONE */
#define IFX_CPU_OMASK9_ONE_MSK (0x7ff)

/** \brief  Offset for Ifx_CPU_OMASK9_Bits.ONE */
#define IFX_CPU_OMASK9_ONE_OFF (17)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN0 */
#define IFX_CPU_OSEL_SHOVEN0_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN0 */
#define IFX_CPU_OSEL_SHOVEN0_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN0 */
#define IFX_CPU_OSEL_SHOVEN0_OFF (0)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN10 */
#define IFX_CPU_OSEL_SHOVEN10_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN10 */
#define IFX_CPU_OSEL_SHOVEN10_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN10 */
#define IFX_CPU_OSEL_SHOVEN10_OFF (10)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN11 */
#define IFX_CPU_OSEL_SHOVEN11_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN11 */
#define IFX_CPU_OSEL_SHOVEN11_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN11 */
#define IFX_CPU_OSEL_SHOVEN11_OFF (11)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN12 */
#define IFX_CPU_OSEL_SHOVEN12_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN12 */
#define IFX_CPU_OSEL_SHOVEN12_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN12 */
#define IFX_CPU_OSEL_SHOVEN12_OFF (12)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN13 */
#define IFX_CPU_OSEL_SHOVEN13_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN13 */
#define IFX_CPU_OSEL_SHOVEN13_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN13 */
#define IFX_CPU_OSEL_SHOVEN13_OFF (13)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN14 */
#define IFX_CPU_OSEL_SHOVEN14_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN14 */
#define IFX_CPU_OSEL_SHOVEN14_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN14 */
#define IFX_CPU_OSEL_SHOVEN14_OFF (14)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN15 */
#define IFX_CPU_OSEL_SHOVEN15_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN15 */
#define IFX_CPU_OSEL_SHOVEN15_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN15 */
#define IFX_CPU_OSEL_SHOVEN15_OFF (15)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN16 */
#define IFX_CPU_OSEL_SHOVEN16_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN16 */
#define IFX_CPU_OSEL_SHOVEN16_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN16 */
#define IFX_CPU_OSEL_SHOVEN16_OFF (16)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN17 */
#define IFX_CPU_OSEL_SHOVEN17_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN17 */
#define IFX_CPU_OSEL_SHOVEN17_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN17 */
#define IFX_CPU_OSEL_SHOVEN17_OFF (17)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN18 */
#define IFX_CPU_OSEL_SHOVEN18_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN18 */
#define IFX_CPU_OSEL_SHOVEN18_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN18 */
#define IFX_CPU_OSEL_SHOVEN18_OFF (18)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN19 */
#define IFX_CPU_OSEL_SHOVEN19_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN19 */
#define IFX_CPU_OSEL_SHOVEN19_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN19 */
#define IFX_CPU_OSEL_SHOVEN19_OFF (19)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN1 */
#define IFX_CPU_OSEL_SHOVEN1_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN1 */
#define IFX_CPU_OSEL_SHOVEN1_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN1 */
#define IFX_CPU_OSEL_SHOVEN1_OFF (1)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN20 */
#define IFX_CPU_OSEL_SHOVEN20_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN20 */
#define IFX_CPU_OSEL_SHOVEN20_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN20 */
#define IFX_CPU_OSEL_SHOVEN20_OFF (20)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN21 */
#define IFX_CPU_OSEL_SHOVEN21_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN21 */
#define IFX_CPU_OSEL_SHOVEN21_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN21 */
#define IFX_CPU_OSEL_SHOVEN21_OFF (21)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN22 */
#define IFX_CPU_OSEL_SHOVEN22_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN22 */
#define IFX_CPU_OSEL_SHOVEN22_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN22 */
#define IFX_CPU_OSEL_SHOVEN22_OFF (22)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN23 */
#define IFX_CPU_OSEL_SHOVEN23_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN23 */
#define IFX_CPU_OSEL_SHOVEN23_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN23 */
#define IFX_CPU_OSEL_SHOVEN23_OFF (23)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN24 */
#define IFX_CPU_OSEL_SHOVEN24_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN24 */
#define IFX_CPU_OSEL_SHOVEN24_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN24 */
#define IFX_CPU_OSEL_SHOVEN24_OFF (24)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN25 */
#define IFX_CPU_OSEL_SHOVEN25_LEN (1)

