Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN25 */
#define IFX_CPU_OSEL_SHOVEN25_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN25 */
#define IFX_CPU_OSEL_SHOVEN25_OFF (25)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN26 */
#define IFX_CPU_OSEL_SHOVEN26_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN26 */
#define IFX_CPU_OSEL_SHOVEN26_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN26 */
#define IFX_CPU_OSEL_SHOVEN26_OFF (26)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN27 */
#define IFX_CPU_OSEL_SHOVEN27_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN27 */
#define IFX_CPU_OSEL_SHOVEN27_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN27 */
#define IFX_CPU_OSEL_SHOVEN27_OFF (27)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN28 */
#define IFX_CPU_OSEL_SHOVEN28_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN28 */
#define IFX_CPU_OSEL_SHOVEN28_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN28 */
#define IFX_CPU_OSEL_SHOVEN28_OFF (28)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN29 */
#define IFX_CPU_OSEL_SHOVEN29_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN29 */
#define IFX_CPU_OSEL_SHOVEN29_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN29 */
#define IFX_CPU_OSEL_SHOVEN29_OFF (29)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN2 */
#define IFX_CPU_OSEL_SHOVEN2_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN2 */
#define IFX_CPU_OSEL_SHOVEN2_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN2 */
#define IFX_CPU_OSEL_SHOVEN2_OFF (2)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN30 */
#define IFX_CPU_OSEL_SHOVEN30_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN30 */
#define IFX_CPU_OSEL_SHOVEN30_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN30 */
#define IFX_CPU_OSEL_SHOVEN30_OFF (30)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN31 */
#define IFX_CPU_OSEL_SHOVEN31_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN31 */
#define IFX_CPU_OSEL_SHOVEN31_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN31 */
#define IFX_CPU_OSEL_SHOVEN31_OFF (31)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN3 */
#define IFX_CPU_OSEL_SHOVEN3_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN3 */
#define IFX_CPU_OSEL_SHOVEN3_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN3 */
#define IFX_CPU_OSEL_SHOVEN3_OFF (3)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN4 */
#define IFX_CPU_OSEL_SHOVEN4_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN4 */
#define IFX_CPU_OSEL_SHOVEN4_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN4 */
#define IFX_CPU_OSEL_SHOVEN4_OFF (4)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN5 */
#define IFX_CPU_OSEL_SHOVEN5_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN5 */
#define IFX_CPU_OSEL_SHOVEN5_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN5 */
#define IFX_CPU_OSEL_SHOVEN5_OFF (5)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN6 */
#define IFX_CPU_OSEL_SHOVEN6_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN6 */
#define IFX_CPU_OSEL_SHOVEN6_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN6 */
#define IFX_CPU_OSEL_SHOVEN6_OFF (6)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN7 */
#define IFX_CPU_OSEL_SHOVEN7_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN7 */
#define IFX_CPU_OSEL_SHOVEN7_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN7 */
#define IFX_CPU_OSEL_SHOVEN7_OFF (7)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN8 */
#define IFX_CPU_OSEL_SHOVEN8_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN8 */
#define IFX_CPU_OSEL_SHOVEN8_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN8 */
#define IFX_CPU_OSEL_SHOVEN8_OFF (8)

/** \brief  Length for Ifx_CPU_OSEL_Bits.SHOVEN9 */
#define IFX_CPU_OSEL_SHOVEN9_LEN (1)

/** \brief  Mask for Ifx_CPU_OSEL_Bits.SHOVEN9 */
#define IFX_CPU_OSEL_SHOVEN9_MSK (0x1)

/** \brief  Offset for Ifx_CPU_OSEL_Bits.SHOVEN9 */
#define IFX_CPU_OSEL_SHOVEN9_OFF (9)

/** \brief  Length for Ifx_CPU_OTAR0_Bits.TBASE */
#define IFX_CPU_OTAR0_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR0_Bits.TBASE */
#define IFX_CPU_OTAR0_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR0_Bits.TBASE */
#define IFX_CPU_OTAR0_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR10_Bits.TBASE */
#define IFX_CPU_OTAR10_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR10_Bits.TBASE */
#define IFX_CPU_OTAR10_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR10_Bits.TBASE */
#define IFX_CPU_OTAR10_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR11_Bits.TBASE */
#define IFX_CPU_OTAR11_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR11_Bits.TBASE */
#define IFX_CPU_OTAR11_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR11_Bits.TBASE */
#define IFX_CPU_OTAR11_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR12_Bits.TBASE */
#define IFX_CPU_OTAR12_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR12_Bits.TBASE */
#define IFX_CPU_OTAR12_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR12_Bits.TBASE */
#define IFX_CPU_OTAR12_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR13_Bits.TBASE */
#define IFX_CPU_OTAR13_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR13_Bits.TBASE */
#define IFX_CPU_OTAR13_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR13_Bits.TBASE */
#define IFX_CPU_OTAR13_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR14_Bits.TBASE */
#define IFX_CPU_OTAR14_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR14_Bits.TBASE */
#define IFX_CPU_OTAR14_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR14_Bits.TBASE */
#define IFX_CPU_OTAR14_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR15_Bits.TBASE */
#define IFX_CPU_OTAR15_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR15_Bits.TBASE */
#define IFX_CPU_OTAR15_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR15_Bits.TBASE */
#define IFX_CPU_OTAR15_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR16_Bits.TBASE */
#define IFX_CPU_OTAR16_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR16_Bits.TBASE */
#define IFX_CPU_OTAR16_TBASE_MSK (0x7fffff)

