Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_OTAR16_Bits.TBASE */
#define IFX_CPU_OTAR16_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR17_Bits.TBASE */
#define IFX_CPU_OTAR17_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR17_Bits.TBASE */
#define IFX_CPU_OTAR17_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR17_Bits.TBASE */
#define IFX_CPU_OTAR17_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR18_Bits.TBASE */
#define IFX_CPU_OTAR18_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR18_Bits.TBASE */
#define IFX_CPU_OTAR18_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR18_Bits.TBASE */
#define IFX_CPU_OTAR18_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR19_Bits.TBASE */
#define IFX_CPU_OTAR19_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR19_Bits.TBASE */
#define IFX_CPU_OTAR19_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR19_Bits.TBASE */
#define IFX_CPU_OTAR19_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR1_Bits.TBASE */
#define IFX_CPU_OTAR1_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR1_Bits.TBASE */
#define IFX_CPU_OTAR1_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR1_Bits.TBASE */
#define IFX_CPU_OTAR1_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR20_Bits.TBASE */
#define IFX_CPU_OTAR20_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR20_Bits.TBASE */
#define IFX_CPU_OTAR20_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR20_Bits.TBASE */
#define IFX_CPU_OTAR20_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR21_Bits.TBASE */
#define IFX_CPU_OTAR21_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR21_Bits.TBASE */
#define IFX_CPU_OTAR21_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR21_Bits.TBASE */
#define IFX_CPU_OTAR21_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR22_Bits.TBASE */
#define IFX_CPU_OTAR22_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR22_Bits.TBASE */
#define IFX_CPU_OTAR22_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR22_Bits.TBASE */
#define IFX_CPU_OTAR22_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR23_Bits.TBASE */
#define IFX_CPU_OTAR23_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR23_Bits.TBASE */
#define IFX_CPU_OTAR23_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR23_Bits.TBASE */
#define IFX_CPU_OTAR23_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR24_Bits.TBASE */
#define IFX_CPU_OTAR24_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR24_Bits.TBASE */
#define IFX_CPU_OTAR24_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR24_Bits.TBASE */
#define IFX_CPU_OTAR24_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR25_Bits.TBASE */
#define IFX_CPU_OTAR25_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR25_Bits.TBASE */
#define IFX_CPU_OTAR25_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR25_Bits.TBASE */
#define IFX_CPU_OTAR25_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR26_Bits.TBASE */
#define IFX_CPU_OTAR26_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR26_Bits.TBASE */
#define IFX_CPU_OTAR26_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR26_Bits.TBASE */
#define IFX_CPU_OTAR26_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR27_Bits.TBASE */
#define IFX_CPU_OTAR27_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR27_Bits.TBASE */
#define IFX_CPU_OTAR27_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR27_Bits.TBASE */
#define IFX_CPU_OTAR27_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR28_Bits.TBASE */
#define IFX_CPU_OTAR28_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR28_Bits.TBASE */
#define IFX_CPU_OTAR28_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR28_Bits.TBASE */
#define IFX_CPU_OTAR28_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR29_Bits.TBASE */
#define IFX_CPU_OTAR29_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR29_Bits.TBASE */
#define IFX_CPU_OTAR29_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR29_Bits.TBASE */
#define IFX_CPU_OTAR29_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR2_Bits.TBASE */
#define IFX_CPU_OTAR2_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR2_Bits.TBASE */
#define IFX_CPU_OTAR2_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR2_Bits.TBASE */
#define IFX_CPU_OTAR2_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR30_Bits.TBASE */
#define IFX_CPU_OTAR30_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR30_Bits.TBASE */
#define IFX_CPU_OTAR30_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR30_Bits.TBASE */
#define IFX_CPU_OTAR30_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR31_Bits.TBASE */
#define IFX_CPU_OTAR31_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR31_Bits.TBASE */
#define IFX_CPU_OTAR31_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR31_Bits.TBASE */
#define IFX_CPU_OTAR31_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR3_Bits.TBASE */
#define IFX_CPU_OTAR3_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR3_Bits.TBASE */
#define IFX_CPU_OTAR3_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR3_Bits.TBASE */
#define IFX_CPU_OTAR3_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR4_Bits.TBASE */
#define IFX_CPU_OTAR4_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR4_Bits.TBASE */
#define IFX_CPU_OTAR4_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR4_Bits.TBASE */
#define IFX_CPU_OTAR4_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR5_Bits.TBASE */
#define IFX_CPU_OTAR5_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR5_Bits.TBASE */
#define IFX_CPU_OTAR5_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR5_Bits.TBASE */
#define IFX_CPU_OTAR5_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR6_Bits.TBASE */
#define IFX_CPU_OTAR6_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR6_Bits.TBASE */
#define IFX_CPU_OTAR6_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR6_Bits.TBASE */
#define IFX_CPU_OTAR6_TBASE_OFF (5)

/** \brief  Length for Ifx_CPU_OTAR7_Bits.TBASE */
#define IFX_CPU_OTAR7_TBASE_LEN (23)

/** \brief  Mask for Ifx_CPU_OTAR7_Bits.TBASE */
#define IFX_CPU_OTAR7_TBASE_MSK (0x7fffff)

/** \brief  Offset for Ifx_CPU_OTAR7_Bits.TBASE */
#define IFX_CPU_OTAR7_TBASE_OFF (5)

