Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Length for Ifx_CPU_RABR10_Bits.OVEN */
#define IFX_CPU_RABR10_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR10_Bits.OVEN */
#define IFX_CPU_RABR10_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR10_Bits.OVEN */
#define IFX_CPU_RABR10_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR11_Bits.OBASE */
#define IFX_CPU_RABR11_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR11_Bits.OBASE */
#define IFX_CPU_RABR11_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR11_Bits.OBASE */
#define IFX_CPU_RABR11_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR11_Bits.OMEM */
#define IFX_CPU_RABR11_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR11_Bits.OMEM */
#define IFX_CPU_RABR11_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR11_Bits.OMEM */
#define IFX_CPU_RABR11_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR11_Bits.OVEN */
#define IFX_CPU_RABR11_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR11_Bits.OVEN */
#define IFX_CPU_RABR11_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR11_Bits.OVEN */
#define IFX_CPU_RABR11_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR12_Bits.OBASE */
#define IFX_CPU_RABR12_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR12_Bits.OBASE */
#define IFX_CPU_RABR12_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR12_Bits.OBASE */
#define IFX_CPU_RABR12_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR12_Bits.OMEM */
#define IFX_CPU_RABR12_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR12_Bits.OMEM */
#define IFX_CPU_RABR12_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR12_Bits.OMEM */
#define IFX_CPU_RABR12_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR12_Bits.OVEN */
#define IFX_CPU_RABR12_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR12_Bits.OVEN */
#define IFX_CPU_RABR12_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR12_Bits.OVEN */
#define IFX_CPU_RABR12_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR13_Bits.OBASE */
#define IFX_CPU_RABR13_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR13_Bits.OBASE */
#define IFX_CPU_RABR13_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR13_Bits.OBASE */
#define IFX_CPU_RABR13_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR13_Bits.OMEM */
#define IFX_CPU_RABR13_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR13_Bits.OMEM */
#define IFX_CPU_RABR13_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR13_Bits.OMEM */
#define IFX_CPU_RABR13_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR13_Bits.OVEN */
#define IFX_CPU_RABR13_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR13_Bits.OVEN */
#define IFX_CPU_RABR13_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR13_Bits.OVEN */
#define IFX_CPU_RABR13_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR14_Bits.OBASE */
#define IFX_CPU_RABR14_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR14_Bits.OBASE */
#define IFX_CPU_RABR14_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR14_Bits.OBASE */
#define IFX_CPU_RABR14_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR14_Bits.OMEM */
#define IFX_CPU_RABR14_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR14_Bits.OMEM */
#define IFX_CPU_RABR14_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR14_Bits.OMEM */
#define IFX_CPU_RABR14_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR14_Bits.OVEN */
#define IFX_CPU_RABR14_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR14_Bits.OVEN */
#define IFX_CPU_RABR14_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR14_Bits.OVEN */
#define IFX_CPU_RABR14_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR15_Bits.OBASE */
#define IFX_CPU_RABR15_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR15_Bits.OBASE */
#define IFX_CPU_RABR15_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR15_Bits.OBASE */
#define IFX_CPU_RABR15_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR15_Bits.OMEM */
#define IFX_CPU_RABR15_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR15_Bits.OMEM */
#define IFX_CPU_RABR15_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR15_Bits.OMEM */
#define IFX_CPU_RABR15_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR15_Bits.OVEN */
#define IFX_CPU_RABR15_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR15_Bits.OVEN */
#define IFX_CPU_RABR15_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR15_Bits.OVEN */
#define IFX_CPU_RABR15_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR16_Bits.OBASE */
#define IFX_CPU_RABR16_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR16_Bits.OBASE */
#define IFX_CPU_RABR16_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR16_Bits.OBASE */
#define IFX_CPU_RABR16_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR16_Bits.OMEM */
#define IFX_CPU_RABR16_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR16_Bits.OMEM */
#define IFX_CPU_RABR16_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR16_Bits.OMEM */
#define IFX_CPU_RABR16_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR16_Bits.OVEN */
#define IFX_CPU_RABR16_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR16_Bits.OVEN */
#define IFX_CPU_RABR16_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR16_Bits.OVEN */
#define IFX_CPU_RABR16_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR17_Bits.OBASE */
#define IFX_CPU_RABR17_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR17_Bits.OBASE */
#define IFX_CPU_RABR17_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR17_Bits.OBASE */
#define IFX_CPU_RABR17_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR17_Bits.OMEM */
#define IFX_CPU_RABR17_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR17_Bits.OMEM */
#define IFX_CPU_RABR17_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR17_Bits.OMEM */
#define IFX_CPU_RABR17_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR17_Bits.OVEN */
#define IFX_CPU_RABR17_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR17_Bits.OVEN */
#define IFX_CPU_RABR17_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR17_Bits.OVEN */
#define IFX_CPU_RABR17_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR18_Bits.OBASE */
#define IFX_CPU_RABR18_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR18_Bits.OBASE */
#define IFX_CPU_RABR18_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR18_Bits.OBASE */
#define IFX_CPU_RABR18_OBASE_OFF (5)

