Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Length for Ifx_CPU_RABR18_Bits.OMEM */
#define IFX_CPU_RABR18_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR18_Bits.OMEM */
#define IFX_CPU_RABR18_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR18_Bits.OMEM */
#define IFX_CPU_RABR18_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR18_Bits.OVEN */
#define IFX_CPU_RABR18_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR18_Bits.OVEN */
#define IFX_CPU_RABR18_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR18_Bits.OVEN */
#define IFX_CPU_RABR18_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR19_Bits.OBASE */
#define IFX_CPU_RABR19_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR19_Bits.OBASE */
#define IFX_CPU_RABR19_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR19_Bits.OBASE */
#define IFX_CPU_RABR19_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR19_Bits.OMEM */
#define IFX_CPU_RABR19_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR19_Bits.OMEM */
#define IFX_CPU_RABR19_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR19_Bits.OMEM */
#define IFX_CPU_RABR19_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR19_Bits.OVEN */
#define IFX_CPU_RABR19_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR19_Bits.OVEN */
#define IFX_CPU_RABR19_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR19_Bits.OVEN */
#define IFX_CPU_RABR19_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR1_Bits.OBASE */
#define IFX_CPU_RABR1_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR1_Bits.OBASE */
#define IFX_CPU_RABR1_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR1_Bits.OBASE */
#define IFX_CPU_RABR1_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR1_Bits.OMEM */
#define IFX_CPU_RABR1_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR1_Bits.OMEM */
#define IFX_CPU_RABR1_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR1_Bits.OMEM */
#define IFX_CPU_RABR1_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR1_Bits.OVEN */
#define IFX_CPU_RABR1_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR1_Bits.OVEN */
#define IFX_CPU_RABR1_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR1_Bits.OVEN */
#define IFX_CPU_RABR1_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR20_Bits.OBASE */
#define IFX_CPU_RABR20_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR20_Bits.OBASE */
#define IFX_CPU_RABR20_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR20_Bits.OBASE */
#define IFX_CPU_RABR20_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR20_Bits.OMEM */
#define IFX_CPU_RABR20_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR20_Bits.OMEM */
#define IFX_CPU_RABR20_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR20_Bits.OMEM */
#define IFX_CPU_RABR20_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR20_Bits.OVEN */
#define IFX_CPU_RABR20_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR20_Bits.OVEN */
#define IFX_CPU_RABR20_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR20_Bits.OVEN */
#define IFX_CPU_RABR20_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR21_Bits.OBASE */
#define IFX_CPU_RABR21_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR21_Bits.OBASE */
#define IFX_CPU_RABR21_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR21_Bits.OBASE */
#define IFX_CPU_RABR21_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR21_Bits.OMEM */
#define IFX_CPU_RABR21_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR21_Bits.OMEM */
#define IFX_CPU_RABR21_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR21_Bits.OMEM */
#define IFX_CPU_RABR21_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR21_Bits.OVEN */
#define IFX_CPU_RABR21_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR21_Bits.OVEN */
#define IFX_CPU_RABR21_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR21_Bits.OVEN */
#define IFX_CPU_RABR21_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR22_Bits.OBASE */
#define IFX_CPU_RABR22_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR22_Bits.OBASE */
#define IFX_CPU_RABR22_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR22_Bits.OBASE */
#define IFX_CPU_RABR22_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR22_Bits.OMEM */
#define IFX_CPU_RABR22_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR22_Bits.OMEM */
#define IFX_CPU_RABR22_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR22_Bits.OMEM */
#define IFX_CPU_RABR22_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR22_Bits.OVEN */
#define IFX_CPU_RABR22_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR22_Bits.OVEN */
#define IFX_CPU_RABR22_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR22_Bits.OVEN */
#define IFX_CPU_RABR22_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR23_Bits.OBASE */
#define IFX_CPU_RABR23_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR23_Bits.OBASE */
#define IFX_CPU_RABR23_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR23_Bits.OBASE */
#define IFX_CPU_RABR23_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR23_Bits.OMEM */
#define IFX_CPU_RABR23_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR23_Bits.OMEM */
#define IFX_CPU_RABR23_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR23_Bits.OMEM */
#define IFX_CPU_RABR23_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR23_Bits.OVEN */
#define IFX_CPU_RABR23_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR23_Bits.OVEN */
#define IFX_CPU_RABR23_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR23_Bits.OVEN */
#define IFX_CPU_RABR23_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR24_Bits.OBASE */
#define IFX_CPU_RABR24_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR24_Bits.OBASE */
#define IFX_CPU_RABR24_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR24_Bits.OBASE */
#define IFX_CPU_RABR24_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR24_Bits.OMEM */
#define IFX_CPU_RABR24_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR24_Bits.OMEM */
#define IFX_CPU_RABR24_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR24_Bits.OMEM */
#define IFX_CPU_RABR24_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR24_Bits.OVEN */
#define IFX_CPU_RABR24_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR24_Bits.OVEN */
#define IFX_CPU_RABR24_OVEN_MSK (0x1)

