Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_RABR24_Bits.OVEN */
#define IFX_CPU_RABR24_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR25_Bits.OBASE */
#define IFX_CPU_RABR25_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR25_Bits.OBASE */
#define IFX_CPU_RABR25_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR25_Bits.OBASE */
#define IFX_CPU_RABR25_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR25_Bits.OMEM */
#define IFX_CPU_RABR25_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR25_Bits.OMEM */
#define IFX_CPU_RABR25_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR25_Bits.OMEM */
#define IFX_CPU_RABR25_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR25_Bits.OVEN */
#define IFX_CPU_RABR25_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR25_Bits.OVEN */
#define IFX_CPU_RABR25_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR25_Bits.OVEN */
#define IFX_CPU_RABR25_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR26_Bits.OBASE */
#define IFX_CPU_RABR26_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR26_Bits.OBASE */
#define IFX_CPU_RABR26_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR26_Bits.OBASE */
#define IFX_CPU_RABR26_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR26_Bits.OMEM */
#define IFX_CPU_RABR26_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR26_Bits.OMEM */
#define IFX_CPU_RABR26_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR26_Bits.OMEM */
#define IFX_CPU_RABR26_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR26_Bits.OVEN */
#define IFX_CPU_RABR26_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR26_Bits.OVEN */
#define IFX_CPU_RABR26_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR26_Bits.OVEN */
#define IFX_CPU_RABR26_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR27_Bits.OBASE */
#define IFX_CPU_RABR27_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR27_Bits.OBASE */
#define IFX_CPU_RABR27_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR27_Bits.OBASE */
#define IFX_CPU_RABR27_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR27_Bits.OMEM */
#define IFX_CPU_RABR27_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR27_Bits.OMEM */
#define IFX_CPU_RABR27_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR27_Bits.OMEM */
#define IFX_CPU_RABR27_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR27_Bits.OVEN */
#define IFX_CPU_RABR27_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR27_Bits.OVEN */
#define IFX_CPU_RABR27_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR27_Bits.OVEN */
#define IFX_CPU_RABR27_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR28_Bits.OBASE */
#define IFX_CPU_RABR28_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR28_Bits.OBASE */
#define IFX_CPU_RABR28_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR28_Bits.OBASE */
#define IFX_CPU_RABR28_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR28_Bits.OMEM */
#define IFX_CPU_RABR28_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR28_Bits.OMEM */
#define IFX_CPU_RABR28_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR28_Bits.OMEM */
#define IFX_CPU_RABR28_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR28_Bits.OVEN */
#define IFX_CPU_RABR28_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR28_Bits.OVEN */
#define IFX_CPU_RABR28_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR28_Bits.OVEN */
#define IFX_CPU_RABR28_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR29_Bits.OBASE */
#define IFX_CPU_RABR29_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR29_Bits.OBASE */
#define IFX_CPU_RABR29_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR29_Bits.OBASE */
#define IFX_CPU_RABR29_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR29_Bits.OMEM */
#define IFX_CPU_RABR29_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR29_Bits.OMEM */
#define IFX_CPU_RABR29_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR29_Bits.OMEM */
#define IFX_CPU_RABR29_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR29_Bits.OVEN */
#define IFX_CPU_RABR29_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR29_Bits.OVEN */
#define IFX_CPU_RABR29_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR29_Bits.OVEN */
#define IFX_CPU_RABR29_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR2_Bits.OBASE */
#define IFX_CPU_RABR2_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR2_Bits.OBASE */
#define IFX_CPU_RABR2_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR2_Bits.OBASE */
#define IFX_CPU_RABR2_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR2_Bits.OMEM */
#define IFX_CPU_RABR2_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR2_Bits.OMEM */
#define IFX_CPU_RABR2_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR2_Bits.OMEM */
#define IFX_CPU_RABR2_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR2_Bits.OVEN */
#define IFX_CPU_RABR2_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR2_Bits.OVEN */
#define IFX_CPU_RABR2_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR2_Bits.OVEN */
#define IFX_CPU_RABR2_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR30_Bits.OBASE */
#define IFX_CPU_RABR30_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR30_Bits.OBASE */
#define IFX_CPU_RABR30_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR30_Bits.OBASE */
#define IFX_CPU_RABR30_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR30_Bits.OMEM */
#define IFX_CPU_RABR30_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR30_Bits.OMEM */
#define IFX_CPU_RABR30_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR30_Bits.OMEM */
#define IFX_CPU_RABR30_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR30_Bits.OVEN */
#define IFX_CPU_RABR30_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR30_Bits.OVEN */
#define IFX_CPU_RABR30_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR30_Bits.OVEN */
#define IFX_CPU_RABR30_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR31_Bits.OBASE */
#define IFX_CPU_RABR31_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR31_Bits.OBASE */
#define IFX_CPU_RABR31_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR31_Bits.OBASE */
#define IFX_CPU_RABR31_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR31_Bits.OMEM */
#define IFX_CPU_RABR31_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR31_Bits.OMEM */
#define IFX_CPU_RABR31_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR31_Bits.OMEM */
#define IFX_CPU_RABR31_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR31_Bits.OVEN */
#define IFX_CPU_RABR31_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR31_Bits.OVEN */
#define IFX_CPU_RABR31_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR31_Bits.OVEN */
#define IFX_CPU_RABR31_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR3_Bits.OBASE */
#define IFX_CPU_RABR3_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR3_Bits.OBASE */
#define IFX_CPU_RABR3_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR3_Bits.OBASE */
#define IFX_CPU_RABR3_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR3_Bits.OMEM */
#define IFX_CPU_RABR3_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR3_Bits.OMEM */
#define IFX_CPU_RABR3_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR3_Bits.OMEM */
#define IFX_CPU_RABR3_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR3_Bits.OVEN */
#define IFX_CPU_RABR3_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR3_Bits.OVEN */
#define IFX_CPU_RABR3_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR3_Bits.OVEN */
#define IFX_CPU_RABR3_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR4_Bits.OBASE */
#define IFX_CPU_RABR4_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR4_Bits.OBASE */
#define IFX_CPU_RABR4_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR4_Bits.OBASE */
#define IFX_CPU_RABR4_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR4_Bits.OMEM */
#define IFX_CPU_RABR4_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR4_Bits.OMEM */
#define IFX_CPU_RABR4_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR4_Bits.OMEM */
#define IFX_CPU_RABR4_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR4_Bits.OVEN */
#define IFX_CPU_RABR4_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR4_Bits.OVEN */
#define IFX_CPU_RABR4_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR4_Bits.OVEN */
#define IFX_CPU_RABR4_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR5_Bits.OBASE */
#define IFX_CPU_RABR5_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR5_Bits.OBASE */
#define IFX_CPU_RABR5_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR5_Bits.OBASE */
#define IFX_CPU_RABR5_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR5_Bits.OMEM */
#define IFX_CPU_RABR5_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR5_Bits.OMEM */
#define IFX_CPU_RABR5_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR5_Bits.OMEM */
#define IFX_CPU_RABR5_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR5_Bits.OVEN */
#define IFX_CPU_RABR5_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR5_Bits.OVEN */
#define IFX_CPU_RABR5_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR5_Bits.OVEN */
#define IFX_CPU_RABR5_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR6_Bits.OBASE */
#define IFX_CPU_RABR6_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR6_Bits.OBASE */
#define IFX_CPU_RABR6_OBASE_MSK (0x1ffff)

