Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_RABR6_Bits.OBASE */
#define IFX_CPU_RABR6_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR6_Bits.OMEM */
#define IFX_CPU_RABR6_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR6_Bits.OMEM */
#define IFX_CPU_RABR6_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR6_Bits.OMEM */
#define IFX_CPU_RABR6_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR6_Bits.OVEN */
#define IFX_CPU_RABR6_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR6_Bits.OVEN */
#define IFX_CPU_RABR6_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR6_Bits.OVEN */
#define IFX_CPU_RABR6_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR7_Bits.OBASE */
#define IFX_CPU_RABR7_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR7_Bits.OBASE */
#define IFX_CPU_RABR7_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR7_Bits.OBASE */
#define IFX_CPU_RABR7_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR7_Bits.OMEM */
#define IFX_CPU_RABR7_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR7_Bits.OMEM */
#define IFX_CPU_RABR7_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR7_Bits.OMEM */
#define IFX_CPU_RABR7_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR7_Bits.OVEN */
#define IFX_CPU_RABR7_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR7_Bits.OVEN */
#define IFX_CPU_RABR7_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR7_Bits.OVEN */
#define IFX_CPU_RABR7_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR8_Bits.OBASE */
#define IFX_CPU_RABR8_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR8_Bits.OBASE */
#define IFX_CPU_RABR8_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR8_Bits.OBASE */
#define IFX_CPU_RABR8_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR8_Bits.OMEM */
#define IFX_CPU_RABR8_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR8_Bits.OMEM */
#define IFX_CPU_RABR8_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR8_Bits.OMEM */
#define IFX_CPU_RABR8_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR8_Bits.OVEN */
#define IFX_CPU_RABR8_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR8_Bits.OVEN */
#define IFX_CPU_RABR8_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR8_Bits.OVEN */
#define IFX_CPU_RABR8_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_RABR9_Bits.OBASE */
#define IFX_CPU_RABR9_OBASE_LEN (17)

/** \brief  Mask for Ifx_CPU_RABR9_Bits.OBASE */
#define IFX_CPU_RABR9_OBASE_MSK (0x1ffff)

/** \brief  Offset for Ifx_CPU_RABR9_Bits.OBASE */
#define IFX_CPU_RABR9_OBASE_OFF (5)

/** \brief  Length for Ifx_CPU_RABR9_Bits.OMEM */
#define IFX_CPU_RABR9_OMEM_LEN (4)

/** \brief  Mask for Ifx_CPU_RABR9_Bits.OMEM */
#define IFX_CPU_RABR9_OMEM_MSK (0xf)

/** \brief  Offset for Ifx_CPU_RABR9_Bits.OMEM */
#define IFX_CPU_RABR9_OMEM_OFF (24)

/** \brief  Length for Ifx_CPU_RABR9_Bits.OVEN */
#define IFX_CPU_RABR9_OVEN_LEN (1)

/** \brief  Mask for Ifx_CPU_RABR9_Bits.OVEN */
#define IFX_CPU_RABR9_OVEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_RABR9_Bits.OVEN */
#define IFX_CPU_RABR9_OVEN_OFF (31)

/** \brief  Length for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_LEN (8)

/** \brief  Mask for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_MSK (0xff)

/** \brief  Offset for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_OFF (0)

/** \brief  Length for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_LEN (2)

/** \brief  Mask for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_MSK (0x3)

/** \brief  Offset for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_OFF (8)

/** \brief  Length for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_LEN (1)

/** \brief  Mask for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_OFF (31)

/** \brief  Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SMACON_Bits.IODT */
#define IFX_CPU_SMACON_IODT_LEN (1)

/** \brief  Mask for Ifx_CPU_SMACON_Bits.IODT */
#define IFX_CPU_SMACON_IODT_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SMACON_Bits.IODT */
#define IFX_CPU_SMACON_IODT_OFF (24)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGN_ACCENA_W_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGN_ACCENA_W_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGN_ACCENA_W_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGN_ACCENA_W_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_LA_ADDR_LEN (27)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_LA_ADDR_MSK (0x7ffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGN_LA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_LA_ADDR_OFF (5)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_UA_ADDR_LEN (27)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_UA_ADDR_MSK (0x7ffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGN_UA_Bits.ADDR */
#define IFX_CPU_SPR_SPROT_RGN_UA_ADDR_OFF (5)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA0_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA0_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA0_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA0_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA1_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA1_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA1_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA1_R_EN_OFF (0)

