Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA2_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA2_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA2_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA2_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA3_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA3_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA3_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA3_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA4_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA4_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA4_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA4_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA5_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA5_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA5_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA5_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA6_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA6_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA6_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA6_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA7_R_EN_LEN (32)

/** \brief  Mask for Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA7_R_EN_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_SPR_SPROT_RGNACCENA7_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA7_R_EN_OFF (0)

/** \brief  Length for Ifx_CPU_SWEVT_Bits.BBM */
#define IFX_CPU_SWEVT_BBM_LEN (1)

/** \brief  Mask for Ifx_CPU_SWEVT_Bits.BBM */
#define IFX_CPU_SWEVT_BBM_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SWEVT_Bits.BBM */
#define IFX_CPU_SWEVT_BBM_OFF (3)

/** \brief  Length for Ifx_CPU_SWEVT_Bits.BOD */
#define IFX_CPU_SWEVT_BOD_LEN (1)

/** \brief  Mask for Ifx_CPU_SWEVT_Bits.BOD */
#define IFX_CPU_SWEVT_BOD_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SWEVT_Bits.BOD */
#define IFX_CPU_SWEVT_BOD_OFF (4)

/** \brief  Length for Ifx_CPU_SWEVT_Bits.CNT */
#define IFX_CPU_SWEVT_CNT_LEN (2)

/** \brief  Mask for Ifx_CPU_SWEVT_Bits.CNT */
#define IFX_CPU_SWEVT_CNT_MSK (0x3)

/** \brief  Offset for Ifx_CPU_SWEVT_Bits.CNT */
#define IFX_CPU_SWEVT_CNT_OFF (6)

/** \brief  Length for Ifx_CPU_SWEVT_Bits.EVTA */
#define IFX_CPU_SWEVT_EVTA_LEN (3)

/** \brief  Mask for Ifx_CPU_SWEVT_Bits.EVTA */
#define IFX_CPU_SWEVT_EVTA_MSK (0x7)

/** \brief  Offset for Ifx_CPU_SWEVT_Bits.EVTA */
#define IFX_CPU_SWEVT_EVTA_OFF (0)

/** \brief  Length for Ifx_CPU_SWEVT_Bits.SUSP */
#define IFX_CPU_SWEVT_SUSP_LEN (1)

/** \brief  Mask for Ifx_CPU_SWEVT_Bits.SUSP */
#define IFX_CPU_SWEVT_SUSP_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SWEVT_Bits.SUSP */
#define IFX_CPU_SWEVT_SUSP_OFF (5)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.BHALT */
#define IFX_CPU_SYSCON_BHALT_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.BHALT */
#define IFX_CPU_SYSCON_BHALT_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.BHALT */
#define IFX_CPU_SYSCON_BHALT_OFF (24)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.FCDSF */
#define IFX_CPU_SYSCON_FCDSF_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.FCDSF */
#define IFX_CPU_SYSCON_FCDSF_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.FCDSF */
#define IFX_CPU_SYSCON_FCDSF_OFF (0)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.IS */
#define IFX_CPU_SYSCON_IS_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.IS */
#define IFX_CPU_SYSCON_IS_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.IS */
#define IFX_CPU_SYSCON_IS_OFF (3)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.IT */
#define IFX_CPU_SYSCON_IT_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.IT */
#define IFX_CPU_SYSCON_IT_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.IT */
#define IFX_CPU_SYSCON_IT_OFF (4)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.PROTEN */
#define IFX_CPU_SYSCON_PROTEN_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.PROTEN */
#define IFX_CPU_SYSCON_PROTEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.PROTEN */
#define IFX_CPU_SYSCON_PROTEN_OFF (1)

/** \brief  Length for Ifx_CPU_SYSCON_Bits.TPROTEN */
#define IFX_CPU_SYSCON_TPROTEN_LEN (1)

/** \brief  Mask for Ifx_CPU_SYSCON_Bits.TPROTEN */
#define IFX_CPU_SYSCON_TPROTEN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_SYSCON_Bits.TPROTEN */
#define IFX_CPU_SYSCON_TPROTEN_OFF (2)

/** \brief  Length for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_LEN (5)

/** \brief  Mask for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_MSK (0x1f)

/** \brief  Offset for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_CON_Bits.TEXP0 */
#define IFX_CPU_TPS_CON_TEXP0_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_CON_Bits.TEXP0 */
#define IFX_CPU_TPS_CON_TEXP0_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TPS_CON_Bits.TEXP0 */
#define IFX_CPU_TPS_CON_TEXP0_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_CON_Bits.TEXP1 */
#define IFX_CPU_TPS_CON_TEXP1_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_CON_Bits.TEXP1 */
#define IFX_CPU_TPS_CON_TEXP1_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TPS_CON_Bits.TEXP1 */
#define IFX_CPU_TPS_CON_TEXP1_OFF (1)

/** \brief  Length for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_MSK (0x1)

