Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_bf.h
/** \brief  Offset for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_OFF (2)

/** \brief  Length for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_OFF (16)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_LEN (8)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_MSK (0xff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_ENTRY_CVAL_LEN (8)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_ENTRY_CVAL_MSK (0xff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_ENTRY_CVAL_OFF (24)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_EXIT_CVAL_LEN (24)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_EXIT_CVAL_MSK (0xffffff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_CVAL_EXIT_CVAL_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_LEN (20)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_MSK (0xfffff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_ENTRY_LVAL_LEN (4)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_ENTRY_LVAL_MSK (0xf)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_ENTRY_LVAL_OFF (28)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_EXIT_LVAL_LEN (20)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_EXIT_LVAL_MSK (0xfffff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_LVAL_EXIT_LVAL_OFF (4)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_OFF (31)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_LEN (3)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_MSK (0x7)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_OFF (24)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_LEN (8)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_MSK (0xff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_OFF (16)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_LEN (1)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_OFF (15)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_LEN (3)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_MSK (0x7)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_OFF (8)

/** \brief  Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_LEN (8)

/** \brief  Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_MSK (0xff)

/** \brief  Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_OFF (0)

/** \brief  Length for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_LEN (32)

/** \brief  Mask for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_OFF (0)

/** \brief  Length for Ifx_CPU_TR_ADR_Bits.ADDR */
#define IFX_CPU_TR_ADR_ADDR_LEN (32)

/** \brief  Mask for Ifx_CPU_TR_ADR_Bits.ADDR */
#define IFX_CPU_TR_ADR_ADDR_MSK (0xffffffff)

/** \brief  Offset for Ifx_CPU_TR_ADR_Bits.ADDR */
#define IFX_CPU_TR_ADR_ADDR_OFF (0)

/** \brief  Length for Ifx_CPU_TR_EVT_Bits.ALD */
#define IFX_CPU_TR_EVT_ALD_LEN (1)

/** \brief  Mask for Ifx_CPU_TR_EVT_Bits.ALD */
#define IFX_CPU_TR_EVT_ALD_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TR_EVT_Bits.ALD */
#define IFX_CPU_TR_EVT_ALD_OFF (28)

/** \brief  Length for Ifx_CPU_TR_EVT_Bits.ASI_EN */
#define IFX_CPU_TR_EVT_ASI_EN_LEN (1)

/** \brief  Mask for Ifx_CPU_TR_EVT_Bits.ASI_EN */
#define IFX_CPU_TR_EVT_ASI_EN_MSK (0x1)

/** \brief  Offset for Ifx_CPU_TR_EVT_Bits.ASI_EN */
#define IFX_CPU_TR_EVT_ASI_EN_OFF (15)

/** \brief  Length for Ifx_CPU_TR_EVT_Bits.ASI */
#define IFX_CPU_TR_EVT_ASI_LEN (5)

/** \brief  Mask for Ifx_CPU_TR_EVT_Bits.ASI */
#define IFX_CPU_TR_EVT_ASI_MSK (0x1f)

/** \brief  Offset for Ifx_CPU_TR_EVT_Bits.ASI */
#define IFX_CPU_TR_EVT_ASI_OFF (16)

/** \brief  Length for Ifx_CPU_TR_EVT_Bits.AST */
#define IFX_CPU_TR_EVT_AST_LEN (1)

/** \brief  Mask for Ifx_CPU_TR_EVT_Bits.AST */
#define IFX_CPU_TR_EVT_AST_MSK (0x1)

